//X13834LH JOB ,,CLASS=9,REGION=0M,
//         MSGLEVEL=(1,1),MSGCLASS=P
//*
//         INCLUDE MEMBER=LIBPARML
//         INCLUDE MEMBER=VARPARML
//*---------------------------------------------------------------
//S05PIEFB EXEC PGM=IEFBR14,COND=(04,LT)
//* //DD1      DD DSN=D.PPS.G01SN.PPS.PPSTEST.PPST002.UNLOAD.ANTES,
//DD1      DD DSN=D.PPS.G01SN.PPS.PPSTEST.PPST002.UNLOAD.DESP,
//            DISP=(MOD,DELETE,DELETE),UNIT=SYSDA,SPACE=(TRK,0)
//*---------------------------------------------------------------
//S02UNL1  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSTSIN  DD DISP=SHR,DSN=&PARMLIB(DSNTISQL)
//* //SYSREC00 DD DSN=D.PPS.G01SN.PPS.PPSTEST.PPST002.UNLOAD.ANTES,
//SYSREC00 DD DSN=D.PPS.G01SN.PPS.PPSTEST.PPST002.UNLOAD.DESP,
//            DISP=(NEW,CATLG,DELETE),                             
//            SPACE=(CYL,(200,200),RLSE),UNIT=SYSDA,          
//            DCB=(RECFM=FB,DSORG=PS)  
//SYSPUNCH DD SYSOUT=*
//SYSIN    DD *
 SELECT * FROM D.CDDTPPS2;
/*
//*
//* EJECUTAR ANTES DE ACTUALIZAR O REVERTIR
//* PARA TENER UN RESPALDO DE LOS DATOS Y COMPARARLOS DESPUES